# IsUnrestrictedCondition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..IsUnrestrictedCondition Method
FabricationServiceButton Class See Also
---
Checks if the condition is unrestricted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsUnrestrictedCondition(
	int condition
)
```

Visual Basic
---
```text
Public Function IsUnrestrictedCondition ( _
	condition As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsUnrestrictedCondition(
	int condition
)
```

# ### Parameters
condition
    Type: System..::..Int32 The condition index.
# ### Return Value
True if the condition is unrestricted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace